# HasValidRevisionSettingsForNumberType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionNumberingSequence..::..HasValidRevisionSettingsForNumberType Method
RevisionNumberingSequence Class See Also
---
Checks whether the revision numbering sequence owns a valid revision settings for number type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool HasValidRevisionSettingsForNumberType()
```

Visual Basic
---
```text
Public Function HasValidRevisionSettingsForNumberType As Boolean
```

Visual C++
---
```text
public:
bool HasValidRevisionSettingsForNumberType()
```

# ### Return Value
True if the revision numbering sequence owns a valid revision settings for number type.
# See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace